Data/TestFiles/cases/Duct/case/constant/porosityProperties
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|                Generated by the CfdOF workbench for FreeCAD                 |
|                      https://github.com/jaheyns/CfdOF                       |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      porosityProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Cylinder
{

    cellZone        Cylinder;
    active          yes;

    type            DarcyForchheimer;

    DarcyForchheimerCoeffs
    {
        d   (0.0 0.0 0.0);
        f   (100.0 100.0 100.0);

        coordinateSystem
        {
            type    cartesian;
            origin  (0 0 0);
            coordinateRotation
            {
                type    axesRotation;
                e1      (1.0 0.0 0.0);
                e3      (0.0 0.0 1.0);
            }
        }
    }
}


//************************************************************************ //
